models/Kokab.php

    public static function selectOptions($id_pro)
    {
        return ArrayHelper::map(static::find()->where(['id_pro'=>$id_pro])->asArray()->all(), 'id_kokab', 'nm_kokab');
---
SELECT * FROM `kokab` WHERE `id_pro` IS NULL