models/Propinsi.php

    public static function selectOptions()
    {
        return ArrayHelper::map(static::find()->all(), 'id_pro', 'nm_pro');
---
SELECT * FROM `propinsi`